service/src/test/resources/ehr/request/MCCI_IN010000UK13_header.xml

<soap:Envelope xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" xmlns:hl7ebxml="urn:hl7-org:transport/ebxml/DSTUv1.0" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <eb:MessageHeader eb:version="2.0" soap:mustUnderstand="1">
            <eb:From>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">N82668-820670</eb:PartyId>
            </eb:From>
            <eb:To>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">B86041-822103</eb:PartyId>
            </eb:To>
            <eb:CPAId>1b09c9557a7794ff6fd2</eb:CPAId>
            <eb:ConversationId>75049C80-5271-11EA-9384-E83935108FD5</eb:ConversationId>
            <eb:Service>urn:nhs:names:services:gp2gp</eb:Service>
            <eb:Action>MCCI_IN010000UK13</eb:Action>
            <eb:MessageData>
                <eb:MessageId>75049C80-5271-11EA-9384-E83935108FD5</eb:MessageId>
                <eb:Timestamp>2020-11-16T17:13:38.682Z</eb:Timestamp>
                <eb:TimeToLive>2020-11-16T23:28:38.682Z</eb:TimeToLive>
            </eb:MessageData>
            <eb:DuplicateElimination/>
        </eb:MessageHeader>
        <eb:AckRequested eb:version="2.0" soap:mustUnderstand="1" soap:actor="urn:oasis:names:tc:ebxml-msg:actor:nextMSH" eb:signed="false"/>
    </soap:Header>
    <soap:Body>
        <eb:Manifest eb:version="2.0" soap:mustUnderstand="1">
            <eb:Reference xlink:href="cid:Content1@e-mis.com/EMISWeb/GP2GP2.2A" xmlns:xlink="http://www.w3.org/1999/xlink">
                <eb:Description xml:lang="en">Application Acknowledgement</eb:Description>
                <hl7ebxml:Payload style="HL7" encoding="XML" version="3.0"/>
            </eb:Reference>
        </eb:Manifest>
    </soap:Body>
</soap:Envelope>